Back-End/soundboard-api/app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "artist", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "woohoo"], ["artist", "jack"], ["created_at", "2022-01-24 18:49:32.625603"], ["updated_at", "2022-01-24 18:49:32.625603"]]
SELECT "tracks".* FROM "tracks" WHERE "tracks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def create
    render json: currentSong = Song.create(title: params["title"], artist: params["artist"])
    tracksInSong = params["active_tracks"]
    for t in tracksInSong do
      currentSong.tracks << Track.find_by_id(t["id"].to_int)

SELECT "songs".* FROM "songs"
---
  def index
    songs = Song.all
    songTracks = []
    songs.each do |s|