Back-End/soundboard-api/app/controllers/tracks_controller.rb

  def index
    render json: Track.all
---
SELECT "tracks".* FROM "tracks"